Repository: VasilyMozgovykh/LinuxApplicationDevelopment2025
Catalog: 12_InstallPackaging/po/*.po
Languages: ru

source: Usage: %s [-r | --help | --version] Simple guess a number game for kids. Program asks user if their number is greater than guessed value and finds the number using binary search. Possible flags: -r Use roman numbers --help Display this help --version Display program version
ru: Использование: %s [-r | --help | --version] Простая игра-угадайка чисел для детей. Программа спрашивает, загаданное число больше текущего или нет, и находит загаданное число бинарным поиском. Возможные флаги: -r Использовать римские цифры --help Показать эту справку --version Показать версию программы

source: Guess a number from I to C.
ru: Загадайте число от I до C.

source: Guess a number from 1 to 100.
ru: Загадайте число от 1 до 100.

source: Is your number greater than %s? (Yes/No):
ru: Ваше число больше, чем %s? (Да/Нет):

source: Is your number greater than %d? (Yes/No):
ru: Ваше число больше, чем %d? (Да/Нет):

source: Input/Output error. Terminating...
ru: Ошибка ввода/вывода. Завершение программы...

source: Yes
ru: Да

source: No
ru: Нет

source: Please answer 'Yes' or 'No'
ru: Пожалуйста, отвечайте 'Да' или 'Нет'

source: Your guessed number is %s!
ru: Вы загадали число %s!

source: Your guessed number is %d!
ru: Вы загадали число %d!
